# ch-03. 판다스 데이터프레임과 시리즈
## 03-1. 데이터 만들기

In [ ]:
import pandas as pd
import os
from collections import OrderedDict
import random
import xlwt
import openpyxl

In [10]:
path = os.getcwd() + '\\data'

In [12]:
os.chdir(path)
os.getcwd()

'C:\\Users\\James\\Documents\\GitHub\\doit_pandas\\data'

### - (p.55) Series

In [13]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

#### * 인덱스 문자열 지정

In [14]:
s_index = pd.Series(['Wes McKinney', 'Creator of Pandas'], index = ['Person', 'Who'])
s_index

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

### - (p.56) DataFrame

In [15]:
scientists = pd.DataFrame({'Name' : ['Rosaline Franklin', 'William Gosset'],
                           'Occupation' : ['Chemist', 'Statistician'],
                           'Born' : ['1920-07-25', '1876-06-13'],
                           'Died' : ['1958-04-16', '1937-10-16'],
                           'Age' : [37, 61]})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

#### * 인덱스 문자열 지정

In [17]:
scientists_index = pd.DataFrame(data = {'Occupation' : ['Chemist', 'Statistician'],
                                        'Born' : ['1920-07-25', '1876-06-13'],
                                        'Died' : ['1958-04-16', '1937-10-16'],
                                        'Age' : [37, 61]}, 
                                index = ['Rosaline Franklin', 'William Gosset'])
scientists_index

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

#### * 열 순서 지정

In [18]:
scientists_index = pd.DataFrame(data = {'Occupation' : ['Chemist', 'Statistician'],
                                        'Born' : ['1920-07-25', '1876-06-13'],
                                        'Died' : ['1958-04-16', '1937-10-16'],
                                        'Age' : [37, 61]}, 
                                index = ['Rosaline Franklin', 'William Gosset'],
                                columns = ['Occupation', 'Age', 'Born', 'Died'])
scientists_index

                     Occupation  Age        Born        Died
Rosaline Franklin       Chemist   37  1920-07-25  1958-04-16
William Gosset     Statistician   61  1876-06-13  1937-10-16

#### * 순서가 보장된 딕셔너리 (OrderedDict)

In [24]:
# 딕셔너리는 순서를 보장하지 않음
# 따라서 DataFrame을 만들 때, OrderedDict 클래스를 사용할 것을 추천

In [25]:
from collections import OrderedDict

In [28]:
scientists_ordered = pd.DataFrame(OrderedDict([
        ('Name', ['Rosaline Franklin', 'William Gosset']),
        ('Occupation', ['Chemist', 'Statistician']),
        ('Born', ['1920-07-25', '1876-06-13']),
        ('Died', ['1958-04-16', '1937-10-16']),
        ('Age', [37, 61])]))

scientists_ordered

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

## 03-2. 시리즈 - 기초

In [36]:
scientists = pd.DataFrame(
    data = {'Occupation' : ['Chemist', 'Statistician'],
            'Born' : ['1920-07-25', '1876-06-13'],
            'Died' : ['1958-04-16', '1937-10-16'],
            'Age' : [37, 61]}, 
    index = ['Rosaline Franklin', 'William Gosset'],
    columns = ['Occupation', 'Born', 'Died', 'Age'])

scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

### - (p.58) df.loc

In [34]:
first_row = scientists.loc['William Gosset']
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

In [35]:
type(first_row)

pandas.core.series.Series

### - (p.59) index, values 속성

In [37]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [29]:
first_row.index[0]

'Occupation'

In [40]:
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [42]:
first_row.values[0]

'Statistician'

### - (p.59) keys 메서드

In [43]:
first_row.keys()

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [44]:
first_row.keys()[0]

'Occupation'

### - (p.60) mean, min, max, std, median 메서드

In [45]:
ages = scientists['Age']
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [46]:
ages.mean()

49.0

In [47]:
ages.min()

37

In [48]:
ages.max()

61

In [49]:
ages.std()

16.97056274847714

In [91]:
ages.median()

49.0

### - (p.61) 시리즈 메서드 정리

#### * append() : 2개 이상의 시리즈 연결

In [61]:
ser1 = pd.Series([60], index = ['kim'])
ser1

kim    60
dtype: int64

In [62]:
ser2 = pd.Series([70], index = ['lee'])
ser2

lee    70
dtype: int64

In [63]:
ser12 = ser1.append(ser2)
ser12

C:\Users\James\AppData\Local\Temp\ipykernel_12828\3646129365.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser12 = ser1.append(ser2)

kim    60
lee    70
dtype: int64

#### * describe() : 요약통계량

In [57]:
ages.describe()

count     2.000000
mean     49.000000
std      16.970563
min      37.000000
25%      43.000000
50%      49.000000
75%      55.000000
max      61.000000
Name: Age, dtype: float64

#### * info() : 요약정보

In [65]:
ages.info()

<class 'pandas.core.series.Series'>
Index: 2 entries, Rosaline Franklin to William Gosset
Series name: Age
Non-Null Count  Dtype
--------------  -----
2 non-null      int64
dtypes: int64(1)
memory usage: 140.0+ bytes

#### * drop_duplicates() : 중복값 재거

In [73]:
ages.drop_duplicates()

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

#### * equals() : 다른 시리즈랑 일치 여부 확인

In [86]:
ages.equals(ages)

True

#### * isin() : 포함된 값 있는 지 확인

In [87]:
ages.isin([37])

Rosaline Franklin     True
William Gosset       False
Name: Age, dtype: bool

#### * replace() : 데이터 교체

In [94]:
ages.replace(37, 30)

Rosaline Franklin    30
William Gosset       61
Name: Age, dtype: int64

#### * sample() : 임의값 반환

In [95]:
ages.sample()

William Gosset    61
Name: Age, dtype: int64

#### * to_frame() : 데이터프레임으로 변환

In [96]:
ages.to_frame()

                   Age
Rosaline Franklin   37
William Gosset      61

#### * sort_values() : 정렬

In [98]:
ages.sort_values(ascending = False)

William Gosset       61
Rosaline Franklin    37
Name: Age, dtype: int64

## 03-3. 시리즈 - 응용

In [99]:
scientists_raw = pd.read_csv('scientists.csv')
scientists = scientists_raw.copy()
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [61]:
scientists.shape

(8, 5)

In [111]:
scientists.describe(include = 'all')

                     Name        Born        Died        Age Occupation
count                   8           8           8   8.000000          8
unique                  8           8           8        NaN          7
top     Rosaline Franklin  1920-07-25  1958-04-16        NaN    Chemist
freq                    1           1           1        NaN          2
mean                  NaN         NaN         NaN  59.125000        NaN
std                   NaN         NaN         NaN  18.325918        NaN
min                   NaN         NaN         NaN  37.000000        NaN
25%                   NaN         NaN         NaN  44.000000        NaN
50%                   NaN         NaN         NaN  58.500000        NaN
75%                   NaN         NaN         NaN  68.750000        NaN
max                   NaN         NaN         NaN  90.000000        NaN

In [100]:
ages = scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [101]:
ages.max()

90

In [102]:
ages.mean()

59.125

### - (p.63) Boolean 추출

In [105]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [106]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [109]:
# manual boolean extraction
manual_bool = [True, True, False, False, True, True, False, True]
ages[manual_bool]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

### - (p.65) 브로드캐스팅

In [75]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [70]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [73]:
ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [74]:
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [76]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [77]:
tmp = pd.Series([1, 100])
tmp

0      1
1    100
dtype: int64

In [78]:
ages + tmp

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [79]:
ages.sort_index()

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [85]:
rev_ages = ages.sort_index(ascending = False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [86]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [87]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

## 03-4. 데이터프레임

### - (p.69) Boolean 추출

In [112]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [113]:
scientists.loc[[True, True, False, True, False, False, True, False]]

                Name        Born        Died  Age          Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1     William Gosset  1876-06-13  1937-10-16   61        Statistician
3        Marie Curie  1867-11-07  1934-07-04   66             Chemist
6        Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

### - (p.70) 브로드캐스팅

In [114]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

## 03-5. 시리즈 및 데이터프레임 데이터 처리

### - (p.71) 열의 자료형 변환

In [119]:
scientists.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 448.0+ bytes

In [115]:
scientists['Born'].dtype

dtype('O')

In [116]:
print(scientists['Born'].dtype)

object

In [120]:
print(scientists['Died'].dtype)

object

#### * object -> datetime64

In [127]:
born_datetime = pd.to_datetime(scientists['Born'], format = '%Y-%m-%d')
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [128]:
died_datetime = pd.to_datetime(scientists['Died'], format = '%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [129]:
print(born_datetime.dtype)

datetime64[ns]

In [130]:
print(died_datetime.dtype)

datetime64[ns]

In [131]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [132]:
scientists.shape

(8, 7)

In [133]:
scientists['age_days_dt'] = scientists['died_dt'] - scientists['born_dt']
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

### - (p.74) 데이터 섞기 : random.shuffle()

In [136]:
import random

In [137]:
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [146]:
# 난수의 기준값 정하기
random.seed(42)

In [147]:
random.shuffle(scientists['Age'])

In [148]:
scientists['Age']

0    77
1    41
2    45
3    90
4    37
5    66
6    61
7    56
Name: Age, dtype: int64

### - (p.75) 열 삭제 : df.drop()

In [157]:
scientists_dropped = scientists.drop(['Age'], axis = 1)

In [158]:
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

In [166]:
scientists_dropped.drop(columns = ['Born', 'Died'])

                   Name          Occupation    born_dt    died_dt age_days_dt
0     Rosaline Franklin             Chemist 1920-07-25 1958-04-16  13779 days
1        William Gosset        Statistician 1876-06-13 1937-10-16  22404 days
2  Florence Nightingale               Nurse 1820-05-12 1910-08-13  32964 days
3           Marie Curie             Chemist 1867-11-07 1934-07-04  24345 days
4         Rachel Carson           Biologist 1907-05-27 1964-04-14  20777 days
5             John Snow           Physician 1813-03-15 1858-06-16  16529 days
6           Alan Turing  Computer Scientist 1912-06-23 1954-06-07  15324 days
7          Johann Gauss       Mathematician 1777-04-30 1855-02-23  28422 days

In [168]:
scientists_dropped.drop(['Born', 'Died'], axis=1)

                   Name          Occupation    born_dt    died_dt age_days_dt
0     Rosaline Franklin             Chemist 1920-07-25 1958-04-16  13779 days
1        William Gosset        Statistician 1876-06-13 1937-10-16  22404 days
2  Florence Nightingale               Nurse 1820-05-12 1910-08-13  32964 days
3           Marie Curie             Chemist 1867-11-07 1934-07-04  24345 days
4         Rachel Carson           Biologist 1907-05-27 1964-04-14  20777 days
5             John Snow           Physician 1813-03-15 1858-06-16  16529 days
6           Alan Turing  Computer Scientist 1912-06-23 1954-06-07  15324 days
7          Johann Gauss       Mathematician 1777-04-30 1855-02-23  28422 days

In [169]:
scientists_dropped

,Name,Born,Died,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,Mathematician,1777-04-30,1855-02-23,28422 days

## 03-6. 데이터 저장하고 불러오기

In [170]:
names = scientists['Name']
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

### - (p.76) pickle 로 저장 : df.to_pickle()

In [171]:
names.to_pickle('scientists_names_series.pickle')

In [172]:
scientists.to_pickle('scientists_df.pickle')

### - (p.77) picke 불러오기 : pd.read_pickle()

In [138]:
scientists_names_from_pickle = pd.read_pickle('scientists_names_series.pickle')
scientists_names_from_pickle

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [173]:
scientists_from_pickle = pd.read_pickle('scientists_df.pickle')
scientists_from_pickle

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,77,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,41,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,45,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,90,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,37,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,66,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,61,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,56,Mathematician,1777-04-30,1855-02-23,28422 days

### - (p.77) csv / tsv 로 저장 : df.to_csv()

In [174]:
names.to_csv('scientists_names_series.csv')

In [175]:
names.to_csv('scientists_names_series.tsv', sep = '\t')

In [176]:
scientists.to_csv('scientists_df.csv')

In [177]:
scientists.to_csv('scientists_df.tsv', sep = '\t')

In [178]:
scientists.to_csv('scientists_df2.csv', index = False)

### - (p.78) excel 로 저장 : df.to_excel()

In [181]:
# 데이터프레임을 .xls 파일로 저장 (단, 이제는 패키지가 유지보수가 안됨)
# (cmd) pip install xlwt

In [182]:
# 데이터프레임을 .xlsx 파일로 저장
# (cmd) pip install openpyxl

In [184]:
import xlwt
import openpyxl

In [185]:
names

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [188]:
# 시리즈는 데이터프레임으로 변환 후 엑셀로 저장 가능
names_df = names.to_frame()

In [187]:
names_df

                   Name
0     Rosaline Franklin
1        William Gosset
2  Florence Nightingale
3           Marie Curie
4         Rachel Carson
5             John Snow
6           Alan Turing
7          Johann Gauss

In [190]:
# warning
names_df.to_excel('scientists_names_series_df.xls')

C:\Users\James\AppData\Local\Temp\ipykernel_12828\3202865178.py:2: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('scientists_names_series_df.xls')

In [192]:
# recommended
names_df.to_excel('scientists_names_series_df.xlsx')

## End.